Unit 4/w20d2/tweeter_app_api/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        render(json: {tweets: Tweet.all})

INSERT INTO "tweets" ("title", "content") VALUES ($1, $2) RETURNING "id"  [["title", "Crentist"], ["content", "My dentist's name is Crentist, maybe that's why he became a dentist"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save